Tekla Open API Reference for Tekla Structures 2025
Matrix.Multiply Operator (Matrix, Matrix)
 Multiplies (combines) two transformation matrices.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Matrix operator *(
	Matrix B,
	Matrix A
)
Public Shared Operator * (
	B As Matrix,
	A As Matrix
) As Matrix
Parameters
B
Type: Tekla.Structures.Geometry3d.Matrix
The transformation matrix which is applied second.
A
Type: Tekla.Structures.Geometry3d.Matrix
The transformation matrix which is applied first.
Return Value
Type: Matrix
The new compound transformation matrix.
See Also
Reference
Matrix Class
Multiply Overload
Tekla.Structures.Geometry3d Namespace